[
{
"title":"instaAPI",
"date":"02/05/2016",
"img":"images/instaAPI.png",
"text":"This was a project I spent a couple of days on to familarize myself better with AJAX calls to a 3rd party API. I am a big Instagram fan, unfortunately their API isn't so intuitive. It was a great learning process to read the docs and user forums. I had to figure out how some things about user access tokens, and JSONP. I'm not sure if JSONP is really required here, if an instructor looks at my code perhaps they could tell me. The animations aren't perfect, but it works!",
"skills":"CSS3, HTML5, JavaScript, jQuery, AJAX",
"url": "http://pauwlsky.github.io/instaAPI/"
},
{
"title":"bootStrapPortfolio",
"date":"11/14/2015",
"img":"images/portfolio1.png",
"text":"This is my old portfolio, one which I still use and which displays my code since I've started learning web programming (back in October 2015). I have been adding to this. It has been a great toying around with this for learning bootstrap, but at this point I'm about ready to abondon it and go onto something else. The site is mobile responsive and makes use of the image source http attribute in breakpoints",
"skills":"CSS3, HTML5, BootStrap",
"url": "http://pauwlsky.github.io/Portfolio/"
},
{
  "title":"storyLocations",
  "date":"01/03/2016",
  "img":"images/storyLocations.png",
  "text":"This is a compilation of Team Treehouse project that I linked together into one page. It doesn't serve any real purpose, it does have working functionality that many webpages have though, and makes use of jQuery plugins, BootStrap, and is completely mobile responsive. This was one of the first projects I used the Googlemaps API on as well, which provided me the grounds to start with skaterPortland. click around and see how you like it :)",
  "skills":"CSS3, HTML5, BootStrap, JavaScript, jQuery, jQuery Plugins, AJAX",
  "url": "http://pauwlsky.github.io/storyLocations/"
},
{
"title":"skaterPortland",
"date":"04/03/2016",
"img":"images/skaterportland.png",
"text":"My most recent project for the Code Fellows 301 entrance test. I sat in on a 201 course where Al Shae described the students gave the students their final project. I decided to take on basically the same assignment the students were given and code my own app within a week. The project took me more time than that of course. Orignially I coded only in JavaScript, now I'm in the process of modularizing the code with requirejs and rewriting all of it using jQuery as well. I have the goal to keep working on this project and add a database to store skate locations. Lots of user interaction to be modified as well. One of my favorite parts of this project was implementing the mobile responsive CSS and JS. Try resizing the window and using the iPhone window in the developer toos :) Feedback is appreciated!",
"skills":"CSS3, HTML5, Mobile Design, JavaScript, jQuery, Googlemaps API, AJAX",
"url": "http://pauwlsky.github.io/code_fellows_challenge/"
}
]
